package kz.algorithm.algorithm;

public class Beeline {
    public static void main(String[] args) {
        String str = "Земную жизнь пройдя до половины\n" +
                "Я очутился в сумрачном лесу,\n" +
                "Утратив правый путь во тьме долины.\n" +
                "Каков он был, о, как произнесу,\n" +
                "Тот дикий лес, дремучий и грозящий,\n" +
                "Чей давний ужас в памяти несу!\n" +
                "Так горек он, что смерть едва ль не слаще.\n" +
                "Но, благо в нем обретши навсегда,\n" +
                "Скажу про все, что видел в этой 4аще.\n" +
                "Не помню сам, как я вошел туда,\n" +
                "Настолько сон меня опутал ложью,\n" +
                "Когда я сбился с верного следа.\n" +
                "Но к холмному прибли3ившись подножью,*\n" +
                "Которым замыкался этот дол,\n" +
                "Мне сжавший сердце ужасом и дрожью,\n" +
                "Я увидал, едва глаза во3вел,\n" +
                "Что свет планеты,* всюду путеводной,\n" +
                "Уже на плечи горные сошел.\n" +
                "Тогда вздохнула более свободной\n" +
                "И долгий страх превозмогла душа,\n" +
                "Измученная ночью безысходной.\n" +
                "И словно тот, кто, тяжело дыша,\n" +
                "На берег выйдя из пучины пенной,\n" +
                "Глядит назад, где волны бьют, страша,\n" +
                "Так и мой дух, бегущий и смятенный,\n" +
                "Вспять обернулся, озирая путь,\n" +
                "Всех уводящий к смерти предреченной.\n" +
                "Когда я телу дал передохнуть,\n" +
                "Я вверх пошел, и мне была опора\n" +
                "В стопе, давившей на земную грудь.\n" +
                "И вот, внизу крутого косогора,\n" +
                "Проворная и вьющаяся рысь,\n" +
                "Вся в ярких пятнах пестрого узора.\n" +
                "Она, кружа, мне преграждала высь,\n" +
                "И я не раз на крутизне опасной\n" +
                "Возвратным следом помышлял спастись.\n" +
                "Был ранний час, и солнце в тверди ясной\n" +
                "Сопровождали те же звезды вновь,*\n" +
                "4то в первый раз, когда их сон прекрасный\n" +
                "Божественная д8инула Любовь.\n" +
                "Доверясь часу и поре счастливой,\n" +
                "Уже не так сжималась в сердце кровь\n" +
                "При виде зверя с шерстью прихотливой;\n" +
                "Но, ужасом опять его стесня,\n" +
                "Навстречу вышел лев с подъятой гривой.\n" +
                "Он наступал как будто на меня,\n" +
                "От голода рыча освирепело\n" +
                "И самый воздух страхом цепеня.\n" +
                "И с ним волчица, чье худое тело,\n" +
                "Казалось, все алчбы в себе несет;\n" +
                "Немало душ из-за нее скорбело.\n" +
                "Меня сковал такой тяжелый гнет,\n" +
                "Перед ее стремящим ужас взглядом,\n" +
                "Что я утратил 4аянье высот.\n" +
                "И как скупец, копивший клад за кладом,\n" +
                "Когда приблизится пора утрат,\n" +
                "Скорбит и плачет по былым отрадам,\n" +
                "Так был и я смятением объят,\n" +
                "За шагом шаг волчицей неуемной\n" +
                "Туда теснимый, где лучи молчат.*\n" +
                "Пока к долине я свергался темной,\n" +
                "Какой-то муж* явился предо мной,\n" +
                "От долгого безмол8ья словно томный.\n" +
                "Его узрев среди пустыни той:\n" +
                "«Спаси, — воззвал я голосом унылым, —\n" +
                "Будь призрак ты, будь человек живой!»\n" +
                "Он отвечал: «Не 4еловек; я был им;\n" +
                "Я от ломбардцев низвожу мой род,\n" +
                "И Мантуя* была их краем милым.\n" +
                "Рожден sub Julio,* хоть в поздний год,\n" +
                "Я в Риме жил под Августовой сенью,*\n" +
                "Когда еще кумиры чтил народ.\n" +
                "Я был поэт и вверил песнопенью,\n" +
                "Как сын Анхиза* отплыл на закат\n" +
                "От гордой Трои, преданной сожженью.\n" +
                "Но что же к муке ты спешишь назад?\n" +
                "Что не восходишь к выси озаренной,\n" +
                "Началу и причине всех отрад?»\n" +
                "«Так ты 8ергилий, ты родник бездонный,\n" +
                "Откуда песни миру потекли? —\n" +
                "Ответил я, склоняя лик смущенный. —\n" +
                "О честь и светоч всех певцов земли,\n" +
                "Уважь любовь и труд неутомимый,\n" +
                "Что в свиток твой мне вникнуть помогли!\n" +
                "Ты мой учитель, мой пример любимый;\n" +
                "Лишь ты один в №аследье мне вручил\n" +
                "Прекрасный слог, везде превозносимый.\n" +
                "Смотри, как этот зверь меня стеснил!\n" +
                "О вещий муж, приди мне на подмогу,\n" +
                "Я трепещу до сокровенных жил!»\n" +
                "«Ты должен выбрать новую дорогу,* —\n" +
                "Он отве4ал мне, увидав мой страх, —\n" +
                "И к дикому не возвращаться логу;\n" +
                "8олчица, от которой ты в слезах,\n" +
                "Всех восходящих гонит, утесняя,\n" +
                "И убивает на своих путях;\n" +
                "Она такая лютая и злая,\n" +
                "Что ненасытно будет голодна,\n" +
                "Вслед за едой еще сильней алкая.\n" +
                "Со всяческою тварью случена,\n" +
                "Она премногих соблазнит, но славный\n" +
                "Нагрянет Пес.* и кончится она.\n" +
                "Не прах земной и не металл двусплавный,*\n" +
                "А честь, любовь и мудрость он вкусит,\n" +
                "Меж войлоком и войлоком* державный.\n" +
                "Италии он будет верный щит,\n" +
                "Той, для которой умерла Камилла,\n" +
                "И Эвриал, и Турн, и №ис убит.*\n" +
                "Свой бег волчица где бы ни стремила,\n" +
                "Ее, нагнав, он заточит в Аду,\n" +
                "Откуда зависть хищницу взманила.\n" +
                "И я тебе скажу в свою чреду:\n" +
                "Иди за мной, и в вечные селенья\n" +
                "Из этих мест тебя я приведу,\n" +
                "И ты услышишь вопли исступленья\n" +
                "И древних духов, бедствующих там,\n" +
                "О новой смерти тщетные моленья;*\n" +
                "Потом увидишь тех, кто чужд скорбям\n" +
                "Среди огня, в №адежде приобщиться\n" +
                "Когда-нибудь к блаженным племенам.\n" +
                "Но если выше ты захочешь взвиться,\n" +
                "Тебя душа достойнейшая* ждет:\n" +
                "С ней ты пойдешь, а мы должны проститься;\n" +
                "Царь горних высей, возбраняя вход\n" +
                "В свой город мне, врагу его устава,\n" +
                "Тех не впускает, кто со мной идет.\n" +
                "Он всюду царь, но там его держава;\n" +
                "Там град его, и там его престол;\n" +
                "Блажен, кому открыта эта слава!»\n" +
                "«О мой поэт, — ему я речь повел, —\n" +
                "Молю Творцом";
        int [] arr = new int []{8, 17, 23, 9 ,5 ,15, 7, 3 ,23, 6, 31, 6, 92, 23,
                129, 1 ,16, 6 ,25 ,7, 46 ,17, 60 ,2 ,86, 24 ,38,
                1 ,67, 21 ,92, 2 ,107 ,2 ,4 ,5 ,25, 2 ,63 ,16, 92, 7 ,104 ,1, 120,
                1, 123, 14 ,50, 15 ,66 ,7 ,76, 1 ,99 ,4, 107, 1, 108, 14 ,
                87, 7, 8,9,10, 89, 1, 88 ,3,4,5,6};

        // leng of lines
        String [] strList = str.split("\n");

        System.out.println(strList.length);

        StringBuilder str1 = new StringBuilder();
        for(int  i= 0 ; i< arr.length -5; i+=2){
            // get ro
            String currentStr = strList[arr[i]].replace(" ", "");
            System.out.println(currentStr);
            char c = currentStr.charAt(arr[i+1]);
            str1.append(c);
        }

        System.out.println(str);
    }
}
